Tekla Open API Reference for Tekla Structures 2025
AngleDimensionAttributes Properties
The AngleDimensionAttributes type exposes the following members.
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Color
 The color of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Format
 The format attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Placing
 The placing attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Text
 The text attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
TransparentBackground
 The dimension text background transparency. (transparent/opaque)
 (Inherited from DimensionSetBaseAttributes.)
TriangleBase
 Gets or sets the triangle base length which controls the base dimension shown for bevel dimensions (only if Type is AngleTypes.Triangle).
TrueColor
 The true color (RGB enabled) of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Type
 The type of the angle.
Top
See Also
Reference
AngleDimensionAttributes Class
Tekla.Structures.Drawing Namespace